code/app/Controllers/Home.php

    public function insertarForm(){
        $mUsuarios = new mUsuarios();
        $usuarioNuevo = [
            "nombres" => $_POST['nombres'],
            "apellidos" => $_POST['apellidos'],
            "correo" => $_POST['correo'],
            "contra" => $_POST['contra']
        ];
        $mUsuarios->insert($usuarioNuevo);
---
INSERT INTO `usuarios` (`nombres`, `apellidos`, `correo`, `contra`) VALUES ('Juan', 'Perez', 'migue@gmail.com', 'a')

    public function actualizarRegistro(){
        $mUsuarios = new mUsuarios();
        $id_usuario = $_POST['id_usuario'];
        $usuarioActualizado = [
            "nombres" => $_POST['nombres'],
            "apellidos" => $_POST['apellidos'],
            "correo" => $_POST['correo'],
            "contra" => $_POST['contra']
        ];
        $mUsuarios->update($id_usuario, $usuarioActualizado);
        $user= $mUsuarios->where('id_usuario', $_POST['id_usuario'])->first();
---
UPDATE `usuarios` SET `nombres` = 'Miguel', `apellidos` = 'Rdz', `correo` = 'miguer82000@gmail.com', `contra` = 'miguer89'
WHERE `usuarios`.`id_usuario` IN ('1')
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '1'
 LIMIT 1

    public function buscarRegistro(){
        $mUsuarios = new mUsuarios();
        $id_usuario = $_POST['id_usuario'];
        $usuario=$mUsuarios->find($id_usuario);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '1'

    public function buscarRegistroG(){
        $mGastos = new mGastos();
        $id_gasto = $_POST['id_gasto'];
        $gasto=$mGastos->find($id_gasto);
---
SELECT *
FROM `gastos`
WHERE `gastos`.`id_gasto` = '10'

    public function eliminarRegistroG(){
        $mGastos = new mGastos();
        $mUsuarios = new mUsuarios();
        $id_gasto = $_POST['id_gasto'];

        $mGastos -> delete($id_gasto);
        $user= $mUsuarios->where('id_usuario', $_POST['id_usuario'])->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '3'
 LIMIT 1

    public function actualizarRegistroG(){
        $mUsuarios = new mUsuarios();
        $mGastos = new mGastos();
        $id_gasto = $_POST['id_gasto'];
        $gastoActualizado = [
            "cantidad" => $_POST['cantidad'],
            "descrip" => $_POST['descrip'],
            "fecha" => $_POST['fecha'],
            "id_usuario" => $_POST['id_usuario'],
            "id_tipo" => $_POST['id_tipo']
        ];
        $mGastos->update($id_gasto, $gastoActualizado);
        $user= $mUsuarios->where('id_usuario', $_POST['id_usuario'])->first();
---
UPDATE `gastos` SET `cantidad` = '5', `descrip` = 'Papas', `fecha` = '2022-03-30', `id_usuario` = '3', `id_tipo` = '1'
WHERE `gastos`.`id_gasto` IN ('12')
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '3'
 LIMIT 1